[
  {
    "id": "0",
    "title": "Senior React/React Native Developer",
    "company": "Stretosphere IT services",
    "description": "In my current position, I specialize in the development of components and pages for cutting-edge Reacr.js web applications and React native Mobile Application. I specialize in building dynamic and user-centric mobile applications using React Native. My work involves integrating backend services, APIs, and third-party libraries to create seamless and high-performance mobile experiences. I collaborate closely with UI/UX design teams to translate visual concepts into functional components, ensuring the final app is both intuitive and visually engaging across platforms. This synergy between design and development helps deliver polished, scalable, and impactful mobile solutions.",
    "timePeriod": "July 2024 - Present",
    "img": "images/stretosphere.jpeg"
  },
  {
    "id": "1",
    "title": "Senior Software Engineer",
    "company": "Smarsh Infotech pvt ltd",
    "description": "At Smarsh Infotech, I led front-end and mobile development initiatives using React.js and React Native in an Agile environment. I built scalable applications using TypeScript, integrated with backend services built on Node.js and Express.js. Leveraging Firebase Firestore and MongoDB, I optimized data handling and performance across platforms. I enhanced user experience and security by integrating Firebase Authentication with Redux Saga. For quality assurance, I implemented end-to-end testing using Cypress. I also developed scalable RESTful APIs and maintained clear technical documentation in Confluence, promoting effective team collaboration. By working closely with stakeholders, I ensured alignment with business goals and improved overall product satisfaction. My task management via Jira helped streamline workflows and ensure on-time delivery of project milestones.",
    "timePeriod": "November 2022 - July 2024",
    "img": "images/smarsh_infotech_logo.jpeg"
  },
  {
    "id": "2",
    "title": "Junior React Native Developer",
    "company": "Unikwork Systems LLP",
    "description": "During Unikwork, I collaborated with a remote team to develop an accessibility-focused travel planning application, emphasizing inclusive design and user experience. In a separate week-long sprint, my partner and I built a Pomodoro Clock application, sharpening our collaboration, time management, and React development skills while working within an Agile framework.",
    "timePeriod": "June 2021 - November 2022",
    "img": "images/unikwork_logo.jpeg"
  }
]