[
  {
    "id": "2",
    "title": "E-Passport",
    "description": "Passport Access is an innovative mobile application that enables instant passport verification through NFC technology. Leveraging React Native's native module integration, the solution allows users to securely read and validate biometric passport data with a simple tap of their mobile device.",
    "thumbnail": "projects/epassport.png",
    "date": "August 2024"
  },
  {
    "id": "3",
    "title": "Intoit",
    "description": "Intoit revolutionizes social music sharing by combining seamless playlist collaboration with dynamic social networking. This mobile application empowers users to Discover & Share Music,Social Feeds,Real-Time Sync,Intuitive UI",
    "thumbnail": "projects/intoit.png",
    "deployed": "https://www.intoitapp.com/",
    "date": "September 2022"
  },
  {
    "id": "4",
    "title": "ArrowSocial Networks",
    "description": "A comprehensive social networking solution enabling seamless digital connections through multimedia interactions and real-time communication. It provides Social Connectivity,Multimedia Posts,Real-Time Communication,Group Interactions",
    "thumbnail": "projects/arrow.png",
    "date": "October 2024"
  },
  {
    "id": "5",
    "title": "Music + You",
    "description": "Music + You is an innovative mobile application designed to connect users through shared musical interests. The platform enables anonymous discovery of nearby individuals, facilitating meaningful connections via music sharing, real-time chat, and social interactions.",
    "thumbnail": "projects/music.jpg",
    "date": "October 2022"
  },
  {
    "id": "6",
    "title": "Orbit Edge Wallet",
    "description": "Orbit Edge Wallet is a blockchain-based application that enables users to issue digital credentials to known individuals, facilitating secure and selective identity sharing. This allows users to verify their identity and gain access to events without disclosing all personal information.",
    "thumbnail": "projects/orbitEdge.png",
    "date": "December 2022"
  },
  {
    "id": "7",
    "title": "Qfasto tV",
    "description": "The Qfasto TV application features a token management system designed for efficient customer handling in mobile care centers. It allows customers to queue virtually and wait for their turn to have their issues addressed in an organized and timely manner.",
    "thumbnail": "projects/unnamed.webp",
    "date": "March 2023"
  },
  {
    "id": "8",
    "title": "JewellBizz",
    "description": "JewellBizz is a business-oriented application that enables users to list their jewelry for B2B bulk sales through a dedicated marketplace. Additionally, individual customers can purchase single items for personal use, explore product reels from nearby sellers, and discover more options for their buying needs.",
    "thumbnail": "projects/jewellBuzz.jpg",
    "date": "May 2024"
  },
  {
    "id": "9",
    "title": "SEB Events",
    "description": "SEB Events is a booking application that allows hotels and companies to reserve stalls at public events to showcase and sell their products. The application manages complete seller information, including contact details, enabling customers to connect with them even after the event.",
    "thumbnail": "projects/seb-events.png",
    "github": "https://github.com/missatrox44/server-rotation-crab-city",
    "deployed": "https://crab-city.vercel.app/",
    "date": "October 2023"
  },
  {
    "id": "10",
    "title": "Movie Mania",
    "description": "Movie Mania is a movie ticket booking application that allows users to reserve seats and enjoy their favorite films with family and friends.",
    "thumbnail": "projects/movieMania.jpg",
    "github": "https://github.com/missatrox44/nextjs-events",
    "deployed": "https://seb-events.vercel.app/",
    "date": "October 2024"
  }
]